
export default function LandingExplanation(props: any) {

    return (
        <div className="landing-exp">
            <h1>פנסיה פתוחה</h1>
            <div>
                <p>
                    אנחנו חוסכים כסף לאורך כל שנות העבודה וכשאנחנו מגיעים לאותו שלב מיוחל בחיים- גיל הפרישה, אנחנו מתחילים לקבל מהחיסכו קצבה כל חודש.
                </p>
                <p>
                כלי המנגיש ידע ממשלתי לשכירים על קרנות פנסיה. בעזרתו לא צריך להיות מומחים לפנסיה כדי להיות בשליטה ולדאוג שהחיסכון לפנסיה יגדל.
                </p>
                <p>
                    שמחים ששאלת... זה יכול להגיע לכמה מאות אלפי ואפילו מיליוני שקלים!
                </p>
                <p>
                    אנחנו צריכים לדאוג  <b>שהחיסכון שלנו ייגדל.</b>
                </p>
            </div>

        </div>
        
    );

}